# HasValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EvaluatedParameter..::..HasValue Property
EvaluatedParameter Class See Also
---
This property is true when the parameter value was successfully obtained, false otherwise.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool HasValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasValue As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasValue {
	bool get ();
}
```

# See Also
EvaluatedParameter Class
Autodesk.Revit.DB Namespace